Revit 2027 API
ConduitSizeSettings.GetEnumerator Method
Returns an enumerator that iterates through a collection.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual IEnumerator<KeyValuePair<string, ConduitSizes>> GetEnumerator()
Public Overridable Function GetEnumerator As IEnumerator(Of KeyValuePair(Of String, ConduitSizes))
public:
virtual IEnumerator<KeyValuePair<String^, ConduitSizes^>>^ GetEnumerator()
abstract GetEnumerator : unit -> IEnumerator<KeyValuePair<string, ConduitSizes>>
override GetEnumerator : unit -> IEnumerator<KeyValuePair<string, ConduitSizes>>
Return Value
IEnumerator<KeyValuePair<String, ConduitSizes>>
An IEnumerator object that can be used to iterate through the collection.
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
ConduitSizeSettings Class
Autodesk.Revit.DB.Electrical Namespace